# while迴圈
# 這是條件是迴圈, 當條件成立時, 會執行迴圈內的程式
i = 1
while i < 10:
    # 當i小於10時, 執行回圈內的程式
    print(i)
    i = i + 1  # 每回合結束時, 把i加1

# 算術指定運算子
# += , -= , *= , /= , //= , %= , **=
# x = x + 1等於 x += 1
# x = x - 1等於 x -= 1
# x = x * 2等於 x *= 2
# x = x / 2等於 x /= 2
# x = x // 2等於 x //= 2
# x = x % 2等於 x %= 2
# x = x ** 2等於 x **= 2

# 符號優先順序
# 1. 括號 ()
# 2. 次方 **
# 3. + - 正負號
# 4. * / // % 乘 除 取整數 取餘數
# 5. + - 加 減
# 6. == != > < >= <= 比較運算子
# 7. not 邏輯非
# 8. and 邏輯且
# 9. or 邏輯或
# 10. = += -= *= /= //= %= **= 算數指定運算子

i = 1
while i < 10:
    print(i)
    i += 1  # i = i + 1

# 密碼門練習
user_input = input("請輸入密碼:")
number = 1
while user_input != "1234":
    user_input = input("密碼錯誤，請重新輸入:")
    number += 1
    if number > 3:
        print("密碼錯誤超過3次，請自動離開！")
print("密碼正確，歡迎進入！")
